data = '10.11.1988'


days = ["первое", "второе","третье", "четвертое","пятое", "шетстое", "седьмое",
         "восьмое", "девятое", "десятое", "одинадцатое", "двенадцатое", "шестнадцатое",
         "семнадцатое", "восемнадцатое", "девятнадцатое", "двадцатое", "двадцать_первое",
         "двадцать_второе", "двадцать_третье", "двадцать_четвертое", "двадцать_пятое",
         "двадцать_шестое", "двадцать_седьмое", "двадцать_восьмое", "двадцать_девятое",
         "тридцатое", "тридцать первое"]

months = ["Января", "Февраля", "Марта", "Апреля", "Мая", "Июля", "Июня","Августа","Сентября",
          "Октября","Ноября","Декабря"]

data_list = data.split('.')
day = days[int(data_list[0])-1]
month = months[int(data_list[1])-1]
year = int(data_list[2])

print(f"{day} {month} {year} года")

print(data_list)